Revit 2024 API
BuiltInFailures.RebarCouplerFailures.CantKeepConstraintsToBars Property
 The constraints between the coupler and the two connected bars are no longer satisfied. Post error to delete the coupler.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CantKeepConstraintsToBars { get; }
Visual Basic
Public Shared ReadOnly Property CantKeepConstraintsToBars As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CantKeepConstraintsToBars {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.RebarCouplerFailures Class
Autodesk.Revit.DB Namespace